// Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
// 0, 7, 8, -2, -2 -> 2
// 1, -7, 567, 89, 223-> 3

Console.Clear();
Console.Write("Введите элементы(через пробел): ");
int[] array = Array.ConvertAll(Console.ReadLine()!.Split(), int.Parse);
Console.WriteLine(string.Join(" ", array));

int count = 0;
for (int i = 0; i < array.Length; i++)
{
    if (array[i] > 0)
    {
        count++;
    }
}
Console.WriteLine($"Чисел больше 0: {count}");
